Revit 2024 API
BuiltInFailures.GeometryFailures.ElementIsTooThin Property
 [Element] is too thin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementIsTooThin { get; }
Visual Basic
Public Shared ReadOnly Property ElementIsTooThin As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementIsTooThin {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace